In [1]:
import pandas as pd

df = pd.read_excel(r"C:\Users\BHATTJ\Desktop\dataset.xlsx")

df.head(10)

    Name   Age      Class
0   jay   25.0  12.000000
1  vijay  26.0  10.000000
2    raj  24.0   9.000000
3   jay   24.0   7.333333
4  vijay  23.5   5.833333
5    raj   NaN        NaN
6   jay   22.5   2.833333
7  vijay  22.0        NaN
8    raj   NaN  -0.166667
9   jay   21.0  -1.666667

# Pandas - Apply function on dataFrame

# Create a Function

In [4]:
def new_fun(x):
    if x<5:
        return 0
    else:
        return x/3

# Apply Function on dataFrame

In [7]:
df

    Name   Age      Class
0   jay   25.0  12.000000
1  vijay  26.0  10.000000
2    raj  24.0   9.000000
3   jay   24.0   7.333333
4  vijay  23.5   5.833333
5    raj   NaN        NaN
6   jay   22.5   2.833333
7  vijay  22.0        NaN
8    raj   NaN  -0.166667
9   jay   21.0  -1.666667

# Lambda Function

In [12]:
df['Class'].apply(lambda x: x/3)

0    4.000000
1    3.333333
2    3.000000
3    2.444444
4    1.944444
5         NaN
6    0.944444
7         NaN
8   -0.055556
9   -0.555556
Name: Class, dtype: float64